Revit 2027 API
ParameterTypeId.StairsTriserTreadNumber Property
 "Tread Number": Count the sequential number of tread in the stair.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsTriserTreadNumber { get; }
Public Shared ReadOnly Property StairsTriserTreadNumber As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsTriserTreadNumber {
	ForgeTypeId^ get ();
}
static member StairsTriserTreadNumber : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace